[
  {
    "name": "Home of Rosquillos",
    "coordinates": [10.4121, 123.9861],
    "category": "Culture",
    "iconUrl": "./rosquillos.png",
    "imageUrl": "./liloanfestival.jpg",
    "description": "The Rosquillos Festival is a cultural and food festival celebrated in Liloan, Cebu, Philippines. It is held in honor of the town’s most famous delicacy, the rosquillos a type of circular cookie. These cookies were first made by Margarita “Titay” Frasco in 1907, and they have since become a beloved local treat.",
    "description2": "For the Rosquillos Festival, wear light and comfortable clothing like a sundress or t-shirt with shorts, paired with comfortable shoes, a hat, and sunglasses to stay cool and stylish in the warm weather.",
    "city name": "Liloan"
  },
  {
    "name": "Carcar City Cebu",
    "coordinates": [10.1151, 123.64],
    "category": "Culture",
    "iconUrl": "./lechon.png",
    "imageUrl": "./carcarlechon.jpg",
    "description": "Carcar is famous for its lechon, considered one of the best in the Philippines. The public market is a must-visit for food lovers, where you can taste freshly roasted lechon with crispy skin and tender meat.",
    "description2": "When visiting Carcar City, especially for food tours, wear light and comfortable clothing like a t-shirt and shorts, paired with comfortable walking shoes. A hat and sunglasses are recommended to protect yourself from the sun.",
    "city name": "Carcar"
  },
  {
    "name": "Simala Shrine",
    "coordinates": [10.0431, 123.5952],
    "category": "Culture",
    "iconUrl": "./church.png",
    "imageUrl": "./sibongachurch.jpg",
    "description": "Sibonga is best known for the Marist Monastery of the Holy Eucharist and a church called Simala Miraculous Mama Mary. They are in a single large building complex, and exceedingly scenic. For Catholics, especially Filipinos, this is a place of pilgrimage.",
    "description2": "Dress modestly and comfortably for your visit to Simala, wearing lightweight clothes, comfortable shoes, and sun protection.",
    "city name": "Sibonga"
  },
  {
    "name": "Sinulog Festival",
    "coordinates": [10.3157, 123.8854],
    "category": "Culture",
    "iconUrl": "./sinulog.png",
    "imageUrl": "./sinulogcebu.jpg",
    "description": "The Sinulog Festival is one of the grandest and most colorful festivals in the Philippines. Held annually in Cebu City, it celebrates the Filipino people's pagan past and their acceptance of Christianity. The main highlight is the street parade featuring participants in colorful costumes dancing to the rhythm of drums and native gongs.",
    "description2": "Wear comfortable clothes suitable for warm weather, such as a t-shirt and shorts. Bring a hat, sunglasses, and wear comfortable shoes as you might be walking a lot.",
    "city name": "Cebu City"
  },
  {
    "name": "Kadaugan sa Mactan",
    "coordinates": [10.307, 123.9794],
    "category": "Culture",
    "iconUrl": "./mactan.png",
    "imageUrl": "./kadaugan.jpg",
    "description": "Kadaugan sa Mactan is a week-long festival held in Lapu-Lapu City, celebrating the historic Battle of Mactan. The highlight is the reenactment of the battle between local chieftain Lapu-Lapu and Portuguese explorer Ferdinand Magellan, which takes place on the shores of Mactan.",
    "description2": "For the Kadaugan sa Mactan festival, wear light, breathable clothing like a t-shirt and shorts or a sundress. Comfortable shoes are a must for walking and standing. A hat, sunglasses, and sunscreen are essential to protect yourself from the sun.",
    "city name": "Lapu-Lapu City"
  },
  {
    "name": "Kagasangan Festival",
    "coordinates": [9.9557, 123.4008],
    "category": "Culture",
    "iconUrl": "./kagasangan.png",
    "imageUrl": "./moalboal.jpg",
    "description": "A cultural event celebrated annually that showcases the local traditions, dances, and music of Moalboal. It highlights the community spirit and cultural heritage of the town.",
    "description2": "Modest and comfortable attire. A sundress, skirt, or pants with a top is appropriate. Ensure that your shoulders and knees are covered as a sign of respect.",
    "city name": "Moalboal"
  },
  {
    "name": "Hinulawan Festival",
    "coordinates": [10.387, 123.6503],
    "category": "Culture",
    "iconUrl": "./hinulawan.png",
    "imageUrl": "./toledo.jpg",
    "description": "The Tingguinay Festival is celebrated in Toledo City to honor the city's patron saint. It features traditional dances, music, and street parades showcasing the local culture and heritage.",
    "description2": "Wear light and breathable clothing suitable for the tropical weather. Comfortable shoes are recommended as you'll be walking a lot. Don’t forget sun protection like a hat and sunscreen.",
    "city name": "Toledo City"
  },
  {
    "name": "Pasko sa Balamban",
    "coordinates": [10.4858, 123.7741],
    "category": "Culture",
    "iconUrl": "./pasko.png",
    "imageUrl": "./paskobalamban.jpg",
    "description": "Pasko sa Balamban is the annual Christmas festival in Balamban, Cebu. The event includes a vibrant Christmas parade, local food stalls, and various cultural performances.",
    "description2": "Dress in casual, comfortable attire and wear appropriate shoes for walking. The event takes place in December, so light jackets or sweaters may be needed for cooler evenings.",
    "city name": "Balamban"
  },
  {
    "name": "Kuyayang Festival",
    "coordinates": [11.0128, 123.9861],
    "category": "Culture",
    "iconUrl": "./kuyayang.png",
    "imageUrl": "./bogo.jpg",
    "description": "A unique cultural celebration in Bogo City, Cebu, held in honor of the city’s romantic heritage. Kuyayang refers to a traditional courtship dance in Bogo, where young men serenade women with graceful and elegant moves to win their affection.",
    "description2": "Light and comfortable clothing is best, along with sun protection like a hat and sunglasses. Wear sturdy shoes for walking through the festival grounds.",
    "city name": "Bogo City"
  },
  {
    "name": "Argao’s Suroy-Suroy Festival",
    "coordinates": [9.9326, 123.5504],
    "category": "Culture",
    "iconUrl": "./suroy.png",
    "imageUrl": "./argao.jpg",
    "description": "The Suroy-Suroy Festival in Argao highlights the town’s local history, crafts, and traditions. The festival features street parades, traditional dances, and showcases the town's unique heritage.",
    "description2": "Wear comfortable clothing suitable for outdoor activities. Bring sun protection like a hat and sunscreen. Comfortable walking shoes are essential.",
    "city name": "Argao"
  },
  {
    "name": "Oslob Cuartel",
    "coordinates": [9.49, 123.39],
    "category": "Culture",
    "iconUrl": "./cuartel.png",
    "imageUrl": "./oslob.jpg",
    "description": "The Oslob Cuartel is an unfinished barracks made of coral stones located near the Oslob Church. It was built during the Spanish colonial period by Filipino laborers under the direction of Spanish authorities. The structure was intended as barracks for Spanish soldiers, but construction was halted due to the arrival of American forces in the late 19th century.",
    "description2": "Wear modest and comfortable attire, as this is a historical site. Light clothing such as a t-shirt and shorts or a sundress is ideal, especially for walking around the area.",
    "city name": "Oslob"
  },
  {
    "name": "Baluarte (Oslob Watchtower)",
    "coordinates": [9.55, 123.42],
    "category": "Culture",
    "iconUrl": "./watchtower.png",
    "imageUrl": "./baluarteoslob.jpg",
    "description": "The Baluarte, or watchtower, is one of the many stone structures built along the coast of Cebu to guard against Moro pirate attacks during the Spanish period. Located near the Oslob Cuartel, this watchtower provides insight into the town's historical defense systems and Spanish colonial rule.",
    "description2": "For a visit to the Baluarte, casual and comfortable clothing is recommended. Wear sturdy shoes for walking along the coastal path, and don’t forget sun protection like a hat or sunscreen.",
    "city name": "Oslob"
  },
  {
    "name": "St. Francis Xavier Church",
    "coordinates": [9.774, 123.336],
    "category": "Culture",
    "iconUrl": "./church.png",
    "imageUrl": "./stfrancisxavier.jpg",
    "description": "The St. Francis Xavier Church in Alegria is a significant cultural landmark. This church, built during the Spanish colonial period, is a testament to the town's rich religious heritage and Spanish influence. It serves as a place of worship and an architectural reminder of the colonial past.",
    "description2": "When visiting St. Francis Xavier Church, modest attire is recommended to show respect for the religious site. Comfortable shoes are ideal for exploring the church grounds and nearby areas. Photography is allowed but be mindful of any ongoing services.",
    "city name": "Alegria"
  },
  {
    "name": "Ani-anihan Festival",
    "coordinates": [10.115, 123.514],
    "category": "Culture & Experiences",
    "iconUrl": "./harvest.png",
    "imageUrl": "./ani-anihan.jpg",
    "description": "The Ani-anihan Festival in Barili is a vibrant celebration of the town’s agricultural heritage and the local community’s gratitude for a bountiful harvest. This annual festival features colorful street parades, traditional dance performances, and displays of local produce, giving visitors a genuine taste of Barili’s rural culture and community life.",
    "description2": "For an enjoyable visit to the Ani-anihan Festival, comfortable, light clothing is recommended, as activities are mostly outdoors. Don’t forget a hat or sunscreen for sun protection, and a camera to capture the colorful floats and costumes. Arriving early ensures a good view of the parades and performances.",
    "city name": "Barili"
  },
  {
    "name": "Silmugi Festival",
    "coordinates": [10.837, 124.013],
    "category": "Culture & Experiences",
    "iconUrl": "./saint.png",
    "imageUrl": "./silmugi.jpg",
    "description": "The Silmugi Festival is an annual celebration in Borbon that showcases the town’s rich heritage and gratitude for the abundant harvest from the Silmugi River. This vibrant festival includes street dancing, traditional music, and local crafts, giving visitors a unique insight into Borbon’s culture and community spirit.",
    "description2": "To experience the Silmugi Festival, visitors should come in comfortable clothing suited for warm weather, as the festivities often take place outdoors. Bring a camera to capture the colorful costumes and lively performances. Arriving early is recommended to find a good spot for viewing the parade and enjoying the cultural displays.",
    "city name": "Borbon"
  },
  {
    "name": "Budbod Festival",
    "coordinates": [10.65, 124.0121],
    "category": "Culture & Experiences",
    "iconUrl": "./stickyrice.png",
    "imageUrl": "./budbod.jpg",
    "description": "The Budbod Festival in Catmon celebrates the town’s rich agricultural heritage and is named after the local delicacy, 'budbod' – a type of rice cake wrapped in banana leaves. This festival includes colorful parades, traditional dances, and a showcase of local culinary delights, giving visitors a taste of Catmon’s unique traditions and community spirit.",
    "description2": "For a memorable experience at the Budbod Festival, wear comfortable clothing suitable for warm weather and outdoor activities. Bring a camera to capture the vibrant costumes and parade floats. Don’t miss the chance to sample the delicious 'budbod' and other local treats sold by vendors along the streets.",
    "city name": "Catmon"
  },
  {
    "name": "Sinulog sa Carmen",
    "coordinates": [10.558, 123.972],
    "category": "Culture & Experiences",
    "iconUrl": "./festivalCarmen.png",
    "imageUrl": "./sinulogCarmen.jpg",
    "description": "Sinulog sa Carmen is a vibrant festival held annually in Carmen, honoring the Santo Niño and showcasing the town’s devotion and cultural traditions. The celebration includes street dancing, elaborate costumes, and lively music, similar to Cebu City’s Sinulog Festival but with a local touch that reflects Carmen’s unique community spirit.",
    "description2": "Visitors attending Sinulog sa Carmen should wear light, comfortable clothing and be prepared for the warm weather, as events take place outdoors. Arriving early is recommended for a good view of the performances. Don’t miss the chance to immerse in the local culture and witness the colorful festivities.",
    "city name": "Carmen"
  },
  {
    "name": "Utanon Festival",
    "coordinates": [9.761, 123.532],
    "category": "Culture & Experiences",
    "iconUrl": "./vegetables.png",
    "imageUrl": "./utanon.jpg",
    "description": "The Utanon Festival in Dalaguete celebrates the town's title as the 'Vegetable Basket of Cebu.' This annual festival showcases the abundant vegetable produce grown in the area, with street dancing, colorful costumes, and floats decorated with fresh vegetables. It’s a lively celebration of the local agricultural heritage and community pride.",
    "description2": "For a visit to the Utanon Festival, wear comfortable clothing and bring a hat or sunscreen for sun protection, as events are often outdoors. Enjoy sampling fresh produce from local vendors, and don’t forget your camera to capture the vibrant costumes and creative vegetable-themed decorations.",
    "city name": "Dalaguete"
  },
  {
    "name": "Tubod Festival",
    "coordinates": [10.721, 123.838],
    "category": "Culture & Experiences",
    "iconUrl": "./spring.png",
    "imageUrl": "./tubodfestival.jpg",
    "description": "The Tubod Festival in Tuburan celebrates the town’s natural springs (or 'tubod' in Cebuano) and its abundant water resources. This annual festival features colorful parades, traditional dances, and water-themed activities, reflecting the town’s deep connection to its springs, rivers, and natural beauty. The event also highlights Tuburan's cultural heritage and community pride.",
    "description2": "For an enjoyable experience at the Tubod Festival, wear comfortable clothing and bring sun protection, as most activities take place outdoors. Capture the vibrant costumes and lively performances, and take the opportunity to explore Tuburan’s scenic landscapes and natural springs.",
    "city name": "Tuburan"
  }
]
